เรียกใช้งาน Pandas

In [1]:
import pandas as pd

สร้าง data frame ประกอบไปด้วย ชื่อ รายงาน ปี

In [2]:
data = {'Name': ['ฟอลคอน', 'ศรีปราชญ์', 'ท้าวทองกีบม้า', 'ขุนหมื่น', 'แม่การะเกด'], 
        'No_House': [4, 24, 31, 2, 3],
        'Year': [1642, 1647, 1650, 1643, 1644]}
df = pd.DataFrame(data, index = ['101', '102', '103', '104', '105'])
print (df) #แสดงผล data

              Name  No_House  Year
101         ฟอลคอน         4  1642
102      ศรีปราชญ์        24  1647
103  ท้าวทองกีบม้า        31  1650
104       ขุนหมื่น         2  1643
105     แม่การะเกด         3  1644

ทำการลบ แถว '101' และ '104' ทิ้งไป

In [3]:
df.drop(['101', '104'])

              Name  No_House  Year
102      ศรีปราชญ์        24  1647
103  ท้าวทองกีบม้า        31  1650
105     แม่การะเกด         3  1644

ทำการลบ คอลัมน์ 'Year' ทิ้งไป

In [4]:
df.drop('Year',axis=1)

              Name  No_House
101         ฟอลคอน         4
102      ศรีปราชญ์        24
103  ท้าวทองกีบม้า        31
104       ขุนหมื่น         2
105     แม่การะเกด         3

ทำการลบ แถวที่มีค่า 'Year' = 1643

In [5]:
df[df.Year != 1643]

              Name  No_House  Year
101         ฟอลคอน         4  1642
102      ศรีปราชญ์        24  1647
103  ท้าวทองกีบม้า        31  1650
105     แม่การะเกด         3  1644